spec/fixtures/soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://postilion/realtime/merchantframework/xsd/v1/">
  <soapenv:Header/>
  <soapenv:Body> 
    <v1:UpdtRecurrProfRequest>
      <v1:merc>
        <v1:id>1234</v1:id> <v1:regKey>abcd</v1:regKey><v1:inType>1</v1:inType>
      </v1:merc>
      <v1:cust>
        <v1:type>0</v1:type>
        <v1:contact>
          <v1:fullName>Juan Marichal</v1:fullName> <v1:phone>
            <v1:type>3</v1:type> <v1:nr>5555555555</v1:nr>
          </v1:phone>
          <v1:addrLn1>12202 Airport Way</v1:addrLn1> 
          <v1:addrLn2>Suite 100</v1:addrLn2> 
          <v1:city>Broomfield</v1:city> 
          <v1:state>CO</v1:state> 
          <v1:zipCode>80021</v1:zipCode> 
          <v1:ctry>US</v1:ctry> 
          <v1:email>test@mail.com</v1:email> 
          <v1:type>1</v1:type>
          <v1:stat>1</v1:stat>
        </v1:contact>
      </v1:cust>
    </v1:UpdtRecurrProfRequest> 
  </soapenv:Body>
</soapenv:Envelope>